docs/ll.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-19 Mon 12:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Some Linear Logic Notes</title>
<meta name="author" content="selffins" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="custom.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Some Linear Logic Notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org86cdd76">1. This Document</a></li>
<li><a href="#org4c1e976">2. Linear Logic intro</a></li>
<li><a href="#org3600f80">3. Multiplicative Conjunction <code>\tens</code></a>
<ul>
<li><a href="#org279e777">3.1. Also known as</a></li>
<li><a href="#org9a5160d">3.2. Intuition</a></li>
<li><a href="#org67c2aa9">3.3. Intro Rule</a></li>
<li><a href="#org437f319">3.4. Elimination Rule</a></li>
<li><a href="#org56eadbf">3.5. Soundness</a></li>
<li><a href="#org2cc5944">3.6. Completeness</a></li>
</ul>
</li>
<li><a href="#orgf51ed1c">4. Additive Conjunction</a>
<ul>
<li><a href="#org3008824">4.1. Also known as</a></li>
<li><a href="#orgdd4f6ff">4.2. Intuition</a></li>
<li><a href="#orgd622b8c">4.3. Intro rule</a></li>
<li><a href="#orgd5a1b0d">4.4. Difference between Multiplicative and Additive connectives</a></li>
<li><a href="#org1527b1e">4.5. Elim rule</a></li>
<li><a href="#org4afa007">4.6. LL additive conjunction is LJ conjunction</a></li>
</ul>
</li>
<li><a href="#orgae716ec">5. Linear Implication</a>
<ul>
<li><a href="#org25a252d">5.1. Also known as</a></li>
<li><a href="#org9a190d3">5.2. Intuition</a></li>
<li><a href="#org7a354ee">5.3. Intro</a></li>
<li><a href="#orge6aa175">5.4. Elimination</a></li>
</ul>
</li>
<li><a href="#orgfcb7d32">6. Unit</a>
<ul>
<li><a href="#orgfa3488a">6.1. Intro</a></li>
<li><a href="#org5357e6a">6.2. Elim</a></li>
</ul>
</li>
<li><a href="#org59c9d7b">7. Top</a></li>
<li><a href="#org7cb5bff">8. <span class="todo TODO">TODO</span> Disjunction</a>
<ul>
<li><a href="#orgafd045c">8.1. Also known as</a></li>
<li><a href="#orgc751bce">8.2. <span class="todo TODO">TODO</span> Intuition</a></li>
</ul>
</li>
<li><a href="#orgc17e1ed">9. Impossibility</a></li>
<li><a href="#orgb3a54b4">10. <span class="todo TODO">TODO</span> Modalities</a>
<ul>
<li><a href="#org19d847e">10.1. Of course</a></li>
<li><a href="#org87bc3b4">10.2. Why not</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr />
<p>
<a href="index.html">Homepage</a>
</p>
<div id="outline-container-org86cdd76" class="outline-2">
<h2 id="org86cdd76"><span class="section-number-2">1.</span> This Document</h2>
<div class="outline-text-2" id="text-1">
<p>
We follow <a href="https://ncatlab.org/nlab/files/Pfenning-LinearLogic98.pdf">Pfenning</a> (1998)&rsquo;s exposition Linear Logic in pages 22-30. We discuss the intro and elimination rules of the connectives as well as some metatheorems.
</p>

<p>
Note: the system being described here is a natural deduction system, not a sequent calculus.
</p>

<p>
However, it is important for purposes of intuition about linear logic - most presentations will be similar and contain the same connectives, have similar proofs of metatheorems.
</p>

<p>
I don&rsquo;t have the capability to insert LaTeX in org-mode, so we will have to make do without the proper syntax and diagrams.
</p>
</div>
</div>
<div id="outline-container-org4c1e976" class="outline-2">
<h2 id="org4c1e976"><span class="section-number-2">2.</span> Linear Logic intro</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>The linear judgement has the form &ldquo;<code>J_2</code> provided resource <code>J_1</code>&rdquo;.</li>
<li>Example: I own book <code>b</code> provided I own <code>$5</code> (if book <code>b</code> is available and costs <code>5$</code>). If we had <code>$5</code>, we could have achieve a situation in which we owned the book.</li>
<li>We can reread the judgement <code>\Delta |- A</code> as, we can use resources <code>\Delta</code> to achieve <code>A</code>.</li>
<li>Linear hypotheses are used exactly once (consumed).</li>
<li>This makes linear logic a logic of resources, as well as a logic of state, because we have to keep track of which resources have been used.</li>
</ul>
</div>
</div>
<div id="outline-container-org3600f80" class="outline-2">
<h2 id="org3600f80"><span class="section-number-2">3.</span> Multiplicative Conjunction <code>\tens</code></h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org279e777" class="outline-3">
<h3 id="org279e777"><span class="section-number-3">3.1.</span> Also known as</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Tensor</li>
<li>Simultaneous conjunction</li>
</ul>
</div>
</div>
<div id="outline-container-org9a5160d" class="outline-3">
<h3 id="org9a5160d"><span class="section-number-3">3.2.</span> Intuition</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Assume we have resources <code>\Delta</code>, and we want to achieve both goals <code>A</code> and <code>B</code> simultaneously. We would have to split our resources into <code>\Delta_1</code> to achieve <code>A</code>, and <code>\Delta_2</code> to achieve <code>B</code>. This split (bottom-up) or merge (top-down) is a non-deterministic operation. This splitting of resources is key to the difference between this and additive conjunction (<code>\par</code>).
</p>
</div>
</div>
<div id="outline-container-org67c2aa9" class="outline-3">
<h3 id="org67c2aa9"><span class="section-number-3">3.3.</span> Intro Rule</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Our intro rule (<code>tens I</code>) for multiplicative conjunction is then:
</p>

<div class="org-src-container">
<pre class="src src-nil">   D_1 |- A    D_2 |- B
 -------------------------- \tens I
  D_1 x D_2 |- A \tens B
</pre>
</div>

<p>
Where <code>x</code> is the non-deterministic merge operation.
</p>
</div>
</div>
<div id="outline-container-org437f319" class="outline-3">
<h3 id="org437f319"><span class="section-number-3">3.4.</span> Elimination Rule</h3>
<div class="outline-text-3" id="text-3-4">
<p>
We start by knowing that we could achieve <code>A \tens B</code> simultaneously from <code>\D</code>, i.e. <code>\D |- A \tens B</code>.
We have to break this connective in order to derive something else (that&rsquo;s what an elimination rule is).
Now with <code>A</code> and <code>B</code>, and any additional resources <code>\D'\</code>, we could achieve <code>C</code>.
</p>

<div class="org-src-container">
<pre class="src src-nil">    D |- A \tens B    D', A, B |- C
---------------------------------------- \tens E
          D x D' |- C
</pre>
</div>

<p>
Basically, we achieve <code>C</code> by first commiting <code>D'</code> to achieve <code>A</code> and <code>B</code> simultaneously, which we commit with <code>\D'</code> in order to achieve <code>C</code>.
</p>
</div>
</div>
<div id="outline-container-org56eadbf" class="outline-3">
<h3 id="org56eadbf"><span class="section-number-3">3.5.</span> Soundness</h3>
<div class="outline-text-3" id="text-3-5">
<p>
To do a proof of (local) soundness, we assume we have the derivations <code>Deriv_1 : \D_1 |- A</code>, <code>Deriv_2 : \D_1 |- B</code>, <code>Deriv_3 : \D', A, B |- C</code> and apply the intro (<code>\tens I</code>) and elimination rules (<code>\tens E</code> to derive <code>\D' x \D_1 x \D_2 |- C</code>.
</p>

<p>
Then we show that we can prove this conclusion directly <code>\D' x \D_1 x \D_2 |- C</code> using the given derivations <code>Deriv_1, Deriv_2, Deriv_3</code> without having to use the introduction and elimination rules for that connective.
</p>

<p>
Basically, we have to show that introducing and eliminating the connective does not give us any new information compared to a proof without that connective.
</p>
</div>
</div>
<div id="outline-container-org2cc5944" class="outline-3">
<h3 id="org2cc5944"><span class="section-number-3">3.6.</span> Completeness</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Completeness is similar to soundness, but from the other direction. We have a direct proof <code>Deriv_1</code> of a formula that has the connective: <code>A \tens B</code>, and then we show that we can break it (bottom-up) into its consituents <code>A</code> and <code>B</code> (and that we do not obtain more judgements that we used to introduce the simultaneous conjunction.)
</p>

<p>
We verify that the elimination rules are strong enough that we can reconstitute the connective from the constituents that we obtain from the elimination rule.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf51ed1c" class="outline-2">
<h2 id="orgf51ed1c"><span class="section-number-2">4.</span> Additive Conjunction</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org3008824" class="outline-3">
<h3 id="org3008824"><span class="section-number-3">4.1.</span> Also known as</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Alternative conjunction</li>
<li>With</li>
<li>Internal choice</li>
</ul>
</div>
</div>
<div id="outline-container-orgdd4f6ff" class="outline-3">
<h3 id="orgdd4f6ff"><span class="section-number-3">4.2.</span> Intuition</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Suppose two books <code>b_1</code>, <code>b_2</code> cost <code>5$</code>. We have <code>5$</code>. Therefore given <code>5$</code>,we can get books <code>A</code> and <code>B</code>, although not simultaneously; we have to make a choice. But the capability to buy <span class="underline">both</span> of them from <code>$5</code> explains why this is a &ldquo;conjunction&rdquo;.
</p>
</div>
</div>
<div id="outline-container-orgd622b8c" class="outline-3">
<h3 id="orgd622b8c"><span class="section-number-3">4.3.</span> Intro rule</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-nil">    \D |- A    \D |- B
-------------------------- &amp;I
        \D |- A &amp; B
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd5a1b0d" class="outline-3">
<h3 id="orgd5a1b0d"><span class="section-number-3">4.4.</span> Difference between Multiplicative and Additive connectives</h3>
<div class="outline-text-3" id="text-4-4">
<p>
We notice that we have the hypotheses <code>\D |- A</code> and <code>\D |- B</code>. As in, we do not split our resources unlike <code>\tens</code>, with its <code>\D_1 |- A</code> and <code>\D_2 |- B</code> to get <code>\D_1 x \D_2 |- A \tens B</code>. This is key to the difference between multiplicative and additve connectives: rules for multiplicative connectives have to split the context.
</p>
</div>
</div>
<div id="outline-container-org1527b1e" class="outline-3">
<h3 id="org1527b1e"><span class="section-number-3">4.5.</span> Elim rule</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-nil">    \D |- A &amp; B
------------------- &amp; E_L
      \D |- A

    \D |- A &amp; B
------------------- &amp; E_R
      \D |- B
</pre>
</div>
</div>
</div>
<div id="outline-container-org4afa007" class="outline-3">
<h3 id="org4afa007"><span class="section-number-3">4.6.</span> LL additive conjunction is LJ conjunction</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Notice the intro rule and elim rules for LL additive conjunction. It&rsquo;s exactly the same as the rules for LJ conjunction. Thus, when we encode LJ into LL, we correspond <code>/\</code> with <code>&amp;</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgae716ec" class="outline-2">
<h2 id="orgae716ec"><span class="section-number-2">5.</span> Linear Implication</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org25a252d" class="outline-3">
<h3 id="org25a252d"><span class="section-number-3">5.1.</span> Also known as</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>resource implication</li>
<li>linear implication</li>
<li>lollipop</li>
</ul>
</div>
</div>
<div id="outline-container-org9a190d3" class="outline-3">
<h3 id="org9a190d3"><span class="section-number-3">5.2.</span> Intuition</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The linear implication internalizes the linear judgement at the level of propositions &#x2013; <code>A -o B</code> for the goal of achieving <code>B</code> with resource <code>A</code>.
</p>
</div>
</div>
<div id="outline-container-org7a354ee" class="outline-3">
<h3 id="org7a354ee"><span class="section-number-3">5.3.</span> Intro</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Hence the intro is:
</p>
<div class="org-src-container">
<pre class="src src-nil">     \D, A |- B
------------------- -o I
     \D |- A -o B
</pre>
</div>
</div>
</div>
<div id="outline-container-orge6aa175" class="outline-3">
<h3 id="orge6aa175"><span class="section-number-3">5.4.</span> Elimination</h3>
<div class="outline-text-3" id="text-5-4">
<p>
If we know <code>A -o B</code>, we can obtain <code>B</code> from a derivation of <code>A</code>.
</p>

<div class="org-src-container">
<pre class="src src-nil">    \D |- A -o B    \D' |- A
-------------------------------- -o E
          \D x \D' |- B
</pre>
</div>

<p>
This is like modus ponens, HOWEVER, notice that we split our resources to prove <code>A -o B</code>, then prove <code>A</code>. This is a multiplicative rule: we need both <code>A -o B</code> and <code>A</code>, so we cannot use all of our resources to prove <code>A -o B</code> only or <code>A</code> only, hence the splitting.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfcb7d32" class="outline-2">
<h2 id="orgfcb7d32"><span class="section-number-2">6.</span> Unit</h2>
<div class="outline-text-2" id="text-6">
<p>
The trivial goal which requires no resources is <code>1</code>. It is the unit of <code>\tens</code>, as in, <code>1 \tens A</code> is equivalent to <code>A</code>.
</p>
</div>
<div id="outline-container-orgfa3488a" class="outline-3">
<h3 id="orgfa3488a"><span class="section-number-3">6.1.</span> Intro</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-nil">-------------- 1 I
    . |- 1
</pre>
</div>

<p>
Notice that we need an empty context (no resources) to prove <code>1</code>.
</p>
</div>
</div>
<div id="outline-container-org5357e6a" class="outline-3">
<h3 id="org5357e6a"><span class="section-number-3">6.2.</span> Elim</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-nil">    \D |- 1    \D' |- C
--------------------------- 1 I
        \D' x \D |- C
</pre>
</div>

<p>
If we can achieve <code>1</code> from some resources <code>\D</code> (? Wouldn&rsquo;t this imply <code>\D</code> is <code>.</code>?), then we can consume <code>\D</code>, and proceed with achieving <code>C</code> using some other resources <code>\D'</code>. Therefore <code>D x D' |- C</code>.
</p>

<p>
Notice again the splitting; this is why it is a multiplicative unit.
</p>
</div>
</div>
</div>
<div id="outline-container-org59c9d7b" class="outline-2">
<h2 id="org59c9d7b"><span class="section-number-2">7.</span> Top</h2>
<div class="outline-text-2" id="text-7">
<p>
The goal that consumes all resources. Unit of <code>&amp;</code>. It follows the same rules as intuitionistic truth. There is only one rule: intro, and no elimination.
</p>

<div class="org-src-container">
<pre class="src src-nil">------------------- \top I
    \D |- \top
</pre>
</div>
</div>
</div>
<div id="outline-container-org7cb5bff" class="outline-2">
<h2 id="org7cb5bff"><span class="section-number-2">8.</span> <span class="todo TODO">TODO</span> Disjunction</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgafd045c" class="outline-3">
<h3 id="orgafd045c"><span class="section-number-3">8.1.</span> Also known as</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>External choice</li>
<li>oplus</li>
</ul>
</div>
</div>
<div id="outline-container-orgc751bce" class="outline-3">
<h3 id="orgc751bce"><span class="section-number-3">8.2.</span> <span class="todo TODO">TODO</span> Intuition</h3>
<div class="outline-text-3" id="text-8-2">
<p>
We ignore this for now.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc17e1ed" class="outline-2">
<h2 id="orgc17e1ed"><span class="section-number-2">9.</span> Impossibility</h2>
<div class="outline-text-2" id="text-9">
<p>
Denoted as <code>0</code>. This is the case of a disjunction between zero alternatives and so is the unit of <code>\oplus</code>. This goal is impossible to prove, so there is no introduction rule, only an elimination.
</p>
<div class="org-src-container">
<pre class="src src-nil">        \D |- 0
 --------------------- 0 E
     \D' x \D |- C
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb3a54b4" class="outline-2">
<h2 id="orgb3a54b4"><span class="section-number-2">10.</span> <span class="todo TODO">TODO</span> Modalities</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org19d847e" class="outline-3">
<h3 id="org19d847e"><span class="section-number-3">10.1.</span> Of course</h3>
</div>
<div id="outline-container-org87bc3b4" class="outline-3">
<h3 id="org87bc3b4"><span class="section-number-3">10.2.</span> Why not</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: selffins</p>
<p class="date">Created: 2025-05-19 Mon 12:50</p>
</div>
</body>
</html>
